InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КассовоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>КассовоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПодключения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначения/Ext/Module.bsl
Функция ПолучитьНастройкиСканера() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |    КО.Ссылка,
        |    КО.ДрайверID,
        |    КО.Порт,
        |    КО.ПараметрыПодключения
        |ИЗ
        |    Справочник.КассовоеОборудование КАК КО
        |ГДЕ
        |    КО.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.СканерШтрихкода)
        |    И НЕ КО.ПометкаУдаления"; 
        
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        Рез = Новый Структура;
        Рез.Вставить("ДрайверID", Выборка.ДрайверID);
        
        // Читаем порт прямо из реквизита!
        // Если не заполнен - ставим дефолтный (например, 1)
        НомерПорта = ?(Выборка.Порт = 0, 1, Выборка.Порт);
        
        // Формируем структуру параметров
        // Остальные параметры (скорость, битность) пока оставляем хардкодом или берем дефолтные,
        // так как порт - самое меняющееся значение.
        Рез.Вставить("Параметры", Новый Структура("Port, Speed, DataBits, StopBits", НомерПорта, 9600, 8, 1));
        
        Возврат Рез;
    КонецЕсли;
    
    Возврат Неопределено;

КонецФункции// Функция поиска товаров.
// Возвращает Массив Структур:
// 1. Номенклатура (СправочникСсылка)
// 2. Цена (Число)
// 3. Представление (Строка) - для списка выбора
Функция НайтиТоварыПоШтрихкоду(Знач Штрихкод, Знач ДатаАктуальности) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Штрихкоды.Номенклатура КАК Номенклатура,
		|	Штрихкоды.Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", СокрЛП(Штрихкод));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЦенаТовара = ПолучитьРозничнуюЦену(ДатаАктуальности, Выборка.Номенклатура);
		
		СтруктураТовара = Новый Структура;
		СтруктураТовара.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураТовара.Вставить("Цена", ЦенаТовара);
		
		// Формируем красивое название для списка: "Молоко (120 руб.)"
		СтруктураТовара.Вставить("Представление", 
			Строка(Выборка.Наименование) + " [" + ЦенаТовара + " руб.]");
		
		Результат.Добавить(СтруктураТовара);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции// Эту функцию мы писали ранее, она тоже должна быть здесь
Функция ПолучитьРозничнуюЦену(АктуальнаяДата, Номенклатура) Экспорт
	
	ТипЦенСсылка = Справочники.ТипыЦен.НайтиПоНаименованию("Розничная");
	
	Если ТипЦенСсылка.Пустая() Тогда
		Возврат 0; 
	КонецЕсли;
	
	Отбор = Новый Структура("Номенклатура, ТипЦен", Номенклатура, ТипЦенСсылка);
	ЗначенияРесурсов = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Если ЗначенияРесурсов.Цена <> Неопределено Тогда
		Возврат ЗначенияРесурсов.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции
